# Basic example

In [1]:
import numpy as np

In [2]:
import pandas as pd  

data = {
    'name' :['hari', 'perivi' , np.NaN , 'krishna','akhil'],
    'age' :[23 , np.NaN , 22,25,23]
}

# ********* If we use 'np.Nan' in int means then all 'int' will convert into a "float"

In [3]:
data

{'name': ['hari', 'perivi', nan, 'krishna', 'akhil'],
 'age': [23, nan, 22, 25, 23]}

In [4]:
df = pd.DataFrame(data)
df

      name   age
0     hari  23.0
1   perivi   NaN
2      NaN  22.0
3  krishna  25.0
4    akhil  23.0

In [5]:
df.isnull().sum()           # It sum only How many NaN

name    1
age     1
dtype: int64

In [6]:
df.isnull().count()     # Don't use count , If we use count means then it will count all elements (include.. NaN , Not a NaN)

name    5
age     5
dtype: int64

# Value_counts()

In [7]:
df["age"].value_counts()    # This is used to cont the seperate values

age
23.0    2
22.0    1
25.0    1
Name: count, dtype: int64

In [8]:
df.value_counts()            # correct , But it will take dataframe columns unique

name     age
akhil    23.0    1
hari     23.0    1
krishna  25.0    1
Name: count, dtype: int64

#### OR

#  unique

##### Correct Nethod

In [9]:
a = np.unique(df['age'] , return_counts=True)
a

(array([22., 23., 25., nan]), array([1, 2, 1, 1], dtype=int64))

In [10]:
df["age"].unique()         # this type unique is uesd to find the seperate index unique

array([23., nan, 22., 25.])

##### Wrong Method

In [11]:
# a = np.unique(df , return_counts=True)
# a

# categorical Data

In [12]:
df1=pd.read_excel("D:\\ML\\17. ML - Chavali.xlsx")
df1

      name cast  age sex   Dob
0    kumar   bc   19   M  2002
1  krishna   oc   20   M  1998
2      sai   sc   22   F  2001
3    pavan   oc   20   M  2003
4   vishnu   bc   21   F  2000
5  sudheer   st   24   M  2003
6    akhil   bc   23   M  2002
7     hari   st   20   F  1999
8    vijay   oc   22   M  2001
9     ajay   sc   21   F  2004

In [13]:
df1.dtypes          # we need to convert object to int

name    object
cast    object
age      int64
sex     object
Dob      int64
dtype: object

###  Below 2 are same

In [14]:
c1 =np.unique(df1['sex'],return_counts = True)   # correct  
c1 

# c1 =np.unique(df1,return_counts = True)     # wrong
# c1

(array(['F', 'M'], dtype=object), array([4, 6], dtype=int64))

In [15]:
df1['sex'].value_counts()     # Correct

# df1.value_counts()         # correct , But it will take dataframe columns unique

sex
M    6
F    4
Name: count, dtype: int64

### Below 2 are same

In [16]:
a1=np.unique(df1['sex'])     # correct 
a1

# a1=np.unique(df1)     # wrong 
# a1

array(['F', 'M'], dtype=object)

In [17]:
df1['sex'].unique()     # Not recomended

array(['M', 'F'], dtype=object)

### THis is used to find length

In [18]:
l1 = len(np.unique(df1['sex']))   # correct
l1


#l1 = len(np.unique(df1))    # wrong    
# l1

2

In [19]:
len(df1['sex'].value_counts())

2

# LabelEncoder

### The label encoder is used to convert the alphabetical data into numerical form

### * Because system understood only numerical form

In [20]:
from sklearn.preprocessing import LabelEncoder

In [21]:
df1['name'].value_counts()

name
kumar      1
krishna    1
sai        1
pavan      1
vishnu     1
sudheer    1
akhil      1
hari       1
vijay      1
ajay       1
Name: count, dtype: int64

In [22]:
label_encoder = LabelEncoder()

In [23]:
df1.dtypes          # we need covert objects into numerical form

name    object
cast    object
age      int64
sex     object
Dob      int64
dtype: object

In [24]:
df1['name'] = label_encoder.fit_transform(df1['name'])
df1['name']

0    4
1    3
2    6
3    5
4    9
5    7
6    1
7    2
8    8
9    0
Name: name, dtype: int32

In [25]:
df1['sex'] = label_encoder.fit_transform(df1['sex'])
df1["sex"]

0    1
1    1
2    0
3    1
4    0
5    1
6    1
7    0
8    1
9    0
Name: sex, dtype: int32

In [26]:
df1['cast'] = label_encoder.fit_transform(df1['cast'])
df1['cast']

0    0
1    1
2    2
3    1
4    0
5    3
6    0
7    3
8    1
9    2
Name: cast, dtype: int32

In [27]:
df1

   name  cast  age  sex   Dob
0     4     0   19    1  2002
1     3     1   20    1  1998
2     6     2   22    0  2001
3     5     1   20    1  2003
4     9     0   21    0  2000
5     7     3   24    1  2003
6     1     0   23    1  2002
7     2     3   20    0  1999
8     8     1   22    1  2001
9     0     2   21    0  2004

In [28]:
df1.dtypes

name    int32
cast    int32
age     int64
sex     int32
Dob     int64
dtype: object

# one hot encoding

### The One hot encoding we can use 2 Methods

#### Using Pandas

In [29]:
import pandas as pd
import numpy as np

In [30]:
df2 =pd.read_excel("D:\\ML\\17. ML - Chavali.xlsx")
df2

      name cast  age sex   Dob
0    kumar   bc   19   M  2002
1  krishna   oc   20   M  1998
2      sai   sc   22   F  2001
3    pavan   oc   20   M  2003
4   vishnu   bc   21   F  2000
5  sudheer   st   24   M  2003
6    akhil   bc   23   M  2002
7     hari   st   20   F  1999
8    vijay   oc   22   M  2001
9     ajay   sc   21   F  2004

In [31]:
a = pd.get_dummies(df2 , dtype=int)   # True = 1  , False = 0
a

# If we not use 'dtype = int' means then it will show true / false

,age,Dob,name_ajay,name_akhil,name_hari,name_krishna,name_kumar,name_pavan,name_sai,name_sudheer,name_vijay,name_vishnu,cast_bc,cast_oc,cast_sc,cast_st,sex_F,sex_M
0,19,2002,0,0,0,0,1,0,0,0,0,0,1,0,0,0,0,1
1,20,1998,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,1
2,22,2001,0,0,0,0,0,0,1,0,0,0,0,0,1,0,1,0
3,20,2003,0,0,0,0,0,1,0,0,0,0,0,1,0,0,0,1
4,21,2000,0,0,0,0,0,0,0,0,0,1,1,0,0,0,1,0
5,24,2003,0,0,0,0,0,0,0,1,0,0,0,0,0,1,0,1
6,23,2002,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,1
7,20,1999,0,0,1,0,0,0,0,0,0,0,0,0,0,1,1,0
8,22,2001,0,0,0,0,0,0,0,0,1,0,0,1,0,0,0,1
9,21,2004,1,0,0,0,0,0,0,0,0,0,0,0,1,0,1,0

In [32]:
a.dtypes

age             int64
Dob             int64
name_ajay       int32
name_akhil      int32
name_hari       int32
name_krishna    int32
name_kumar      int32
name_pavan      int32
name_sai        int32
name_sudheer    int32
name_vijay      int32
name_vishnu     int32
cast_bc         int32
cast_oc         int32
cast_sc         int32
cast_st         int32
sex_F           int32
sex_M           int32
dtype: object

#### Using Sklearn  (Noo Need)

In [33]:
df2

      name cast  age sex   Dob
0    kumar   bc   19   M  2002
1  krishna   oc   20   M  1998
2      sai   sc   22   F  2001
3    pavan   oc   20   M  2003
4   vishnu   bc   21   F  2000
5  sudheer   st   24   M  2003
6    akhil   bc   23   M  2002
7     hari   st   20   F  1999
8    vijay   oc   22   M  2001
9     ajay   sc   21   F  2004

In [34]:
from sklearn.preprocessing import OneHotEncoder

In [35]:
encoder = OneHotEncoder(sparse=False)